app/Models/Tb_file.php

    public function getData($id = false)
    {
        if ($id == false) {
            return $this->findAll();
        } else {
            return $this->where("id_file", $id)->first();
---
SELECT *
FROM `tb_file`
SELECT *
FROM `tb_file`
WHERE `id_file` = '1'
 LIMIT 1