app/Models/Tb_hasil.php

    public function get_all_ip_add($id_percobaan)
    {
        $data = $this->select("ip_add")->where("id_percobaan", $id_percobaan)->findAll();
---
SELECT `ip_add`
FROM `tb_hasil`
WHERE `id_percobaan` = '1'

    public function getTime($ip_add, $id_percobaan)
    {

        $data = $this->select("waktu")->where("ip_add", $ip_add)->where("id_percobaan", $id_percobaan)->first();
---
SELECT `waktu`
FROM `tb_hasil`
WHERE `ip_add` = '192.168.10.27'
AND `id_percobaan` = '1'
 LIMIT 1

    public function getTimeToAnalisis($ip_add, $id_percobaan)
    {

        $data = $this->select("waktu")->where("ip_add", $ip_add)->where("id_percobaan", $id_percobaan)->first();
---
SELECT `waktu`
FROM `tb_hasil`
WHERE `ip_add` = '192.168.10.27'
AND `id_percobaan` = '1'
 LIMIT 1