app/Models/Tb_percobaan.php

    public function get_percobaan($id_file)
    {

        $data = $this
            ->select("percobaan")
            ->where("id_file", $id_file)
            ->orderBy("percobaan", "DESC")
            ->first();
---
SELECT `percobaan`
FROM `tb_percobaan`
WHERE `id_file` = '1'
ORDER BY `percobaan` DESC
 LIMIT 1

    public function get_all_id_percobaan($id_file)
    {
        $data = $this->select('id_percobaan')->where("id_file", $id_file)->findAll();
---
SELECT `id_percobaan`
FROM `tb_percobaan`
WHERE `id_file` = '1'

    public function get_all_id_file()
    {
        $data = $this->select("id_file")->where("percobaan >=", 1)->findAll();
---
SELECT `id_file`
FROM `tb_percobaan`
WHERE `percobaan` >= 1

    public function Cek_file($id_file)
    {
        $data = $this
            ->select("percobaan")
            ->where("id_file", $id_file)
            ->orderBy("percobaan", "DESC")
            ->first();
---
SELECT `percobaan`
FROM `tb_percobaan`
WHERE `id_file` = '1'
ORDER BY `percobaan` DESC
 LIMIT 1